paymentgateway/paypal/tests/fixtures/ipn_failed.txt

mc_gross=50.00&protection_eligibility=Eligible&address_status=confirmed&item_number1=2&payer_id=ZFDYPPYELC4KS&address_street=1+Cheeseman+Ave+Brighton+East&payment_date=16%3A09%3A34+Sep+14%2C+2020+PDT&payment_status=Failed&charset=UTF-8&address_zip=3001&first_name=John&mc_fee=6.06&address_country_code=AU&address_name=John+Doe&notify_version=3.9&custom=3-2&payer_status=verified&business=test%40business.example.com&address_country=Australia&num_cart_items=1&address_city=Melbourne&verify_sign=AUfa3X9ucTpBB96A3E9.Y.dp3mr.Aqxpzaudxz8EaAo6dRuW.mn0qLm2&payer_email=test%40personal.example.com&txn_id=1YR097324Y527661V&payment_type=instant&last_name=Doe&item_name1=Test%20course_1%2B2%3D3&address_state=Victoria&receiver_email=test%40business.example.com&payment_fee=&shipping_discount=0.00&quantity1=1&insurance_amount=0.00&receiver_id=T9CHS2ZUN6BL6&txn_type=cart&discount=0.00&mc_gross_1=50.00&mc_currency=USD&residence_country=AU&shipping_method=Default&transaction_subject=&payment_gross=&ipn_track_id=9cc4e64263707